tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "cmake"
brew "readline"
brew "docutils"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "graphviz"
brew "gpg"
brew "gnupg"
brew "imagemagick"
brew "libjpeg"
brew "librsvg"
brew "libtiff"
brew "libxmlsec1"
brew "libxslt"
brew "little-cms2"
brew "openconnect"
brew "openssl"
brew "pipenv"
brew "postgresql"
brew "rbenv"
brew "redis"
brew "sqlite"
brew "webp"
brew "xz"
brew "yarn"
brew "zlib"
brew "zsh"
brew "docker-compose"
brew "markdown"
brew "yarn"
brew "ag"
brew "rust"
brew "wireguard-tools"
brew "rbenv"
brew "skopeo"
brew "nodejs"
brew "yarn"
brew "sassc"
# https://stackoverflow.com/a/40066889
brew "pinentry-mac"

cask "discord"
cask "docker"
cask "keepingyouawake"
cask "1password"
cask "brave-browser"
cask "emacs"
cask "alfred"
cask "rectangle"
cask "whatsapp"
cask "spotify"
cask "iterm2"
cask "readdle-spark"
cask "slack"
cask "vlc"
